/**
 * 
 * 1. Зробити руз гравця по натисканню клавіш.  - готово -
 * 
 * 2. Зробити постріли:
 *      - створити кулю;  - готово -
 *      - зробити рух кулі;  - готово -
 *      - зробити перевіпку попадання кулі по ворогу чи астероїду.  - готово -
 * 3. Зробити вибір гравця при запуску гри.  - готово -
 * 
 * 4. Створити ворогів та рух ворогів   - готово -
 * 
 * 5. Створити життя. - готово -
 * 
 * 6. Якщо ворог пройшов гравця та відняти життя.   - готово -
 * 
 * 7. Якщо життя закінчились завершити гру.   - готово -
 * 
 * 8. Переробити рух гравця.   - готово -
 * 
 * 1. Створення елементів.
 * 2. робота з координатами.
 * 3. Працювати з подіями натискання клавіш.
 * 4. Працювати з таймерами.
 * 5. Розбиття коду на різні файли.
 */

/**
 *  ДЗ
 *  1. Зробити кількість очків.   - готово -
 *  2. Вивести рахунок на екран.   - готово -
 *  3. Змінювати рахунок після поразки ворога.   - готово -
 *  4 Зробити зміну швидкості ворогів після збульшення очків.(10 літачків збільшення швидкості на 5 пікселів).   - готово -
 * 
 * 
 *  5. Зробити бонуси:
 *      - додає життя   - готово -
 *      - вбити всіх ворогів   - готово -
 *  6. Зробити випадкове створення ворогів.    - готово -
 *  7. Зробити для кожного скіна свій бластер:
 *      - КУЛІ ВИЛІТАЮТЬ З РІЗНИХ місць    - готово -
 *      - додати більше отворів для пострілів    - готово -
 *      - у кожного літачка свій звук пострілів   - готово -
 * 8. Зробити різні типи ворогів
 *      - різні скіни   - готово -
 *      - різні анамації вибуху    - готово -
 */




let app = document.querySelector('#gameElements');
isGameOver = false;


function random(min, max){
    let rand = min + Math.random() * (max + 1 - min);
    return Math.floor(rand);
}

